КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ДФ_Титул1/КонтурЛогистика_ДФ_Титул1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ДФ_Титул1</name>
  <posting>Deny</posting>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ДФ</name>
    <comment>(из пула!) Выдается ГИС ЭПД Уникальный идентификатор документа заказа (заявки)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфФт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфФт</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Составитель</name>
    <comment>Сведения о лице, составителе Т1 ДФ</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснДовОргСост</name>
    <comment>Основание, по которому экономический субъект является составителем файла обмена</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтователь</name>
    <comment>Фрахтователь</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрахтовщик</name>
    <comment>Фрахтовщик</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПассажиры</name>
    <comment>иначе грузы Принимает значение: 0 – перевозка груза с сопровождением представителя грузовладельца, перевозка груза, в отношении которого не ведется учет движения товарно-материальных ценностей   |1 – перевозка пассажиров и багажа по заказу</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КругЛицОпределен</name>
    <comment>если ЭтоПассажиры</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПассажирыДопущены</name>
    <comment>ДопускПсжр Порядок допуска пассажиров для посадки в транспортное средство, установленный с учетом требований, предусмотренных правилами перевозок пассажиров (в случае, если транспортное средство предоставляется для перевозки определенного круга лиц)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТСТип</name>
    <comment>Тип предоставляемого транспортного средства (при необходимости – количество транспортных средств)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполненияПеревозки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПодачи</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяПодачи</name>
    <comment>Дата и время подачи ТС</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Маршрут</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутМашиночитаемый</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>для себя, не отправим в документе</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИныеУсловия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлатСтУсл</name>
    <comment>СтУсл</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРасхПлатДор</name>
    <comment>РасхПлатДор</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРасхТамПош</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРасхПром</name>
    <comment>РасхПром</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРазмерПлат</name>
    <comment>РазмерПлат</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлатРасчет</name>
    <comment>Расчет</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.КонтурЛогистика_Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество в терминах документа 1С (до конвертации)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.КонтурЛогистика_УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Учитывать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтгрузочноеНаименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеГруза</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпособУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидТары</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТНВЭД</name>
      <comment>необязательное поле</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемКубМ</name>
      <comment>Необязательное поле</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаПлановаяБруттоКг</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаПлановаяНеттоКг</name>
      <comment>необязательная, обязательная - Брутто</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаТарыКг</name>
      <comment>необязательная</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПаллет</name>
      <comment>необязательное поле</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопИнформация</name>
      <comment>ИнфГруз (необязательное поле)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъявленнаяЦенность</name>
      <comment>Стоимость (ценность) груза с налогом - всего</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъявленнаяЦенностьВалюта</name>
      <comment>Стоимость (ценность) груза с налогом - всего</comment>
      <type>
        <types>DefinedType.КонтурЛогистика_Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>Плотность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВозможностьРаспределения</name>
      <comment>ВозмРаспр Возможность распределения груза для соблюдения допустимой нагрузки по осям транспортных средств</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_УИДыГИС/КонтурЛогистика_УИДыГИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_УИДыГИС</name>
  <comment>Хранит пул доступных для использования УИДов минтранса</comment>
  <resources>
    <name>Использован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата операции добавления / использования</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Enums/КонтурЛогистика_КатегорииОшибокОбъектов/КонтурЛогистика_КатегорииОшибокОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КонтурЛогистика_КатегорииОшибокОбъектов</name>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДиадок</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаДругойСтороны</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаКриптографии</name>
  </enumValues>
</mdclass:Enum>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ДФ_Титул1/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаДФ(Данные, Представление, СтандартнаяОбработка, "1");
	
КонецПроцедуры

Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен Тогда 
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		// TODO - доделать валидатор
		//
		//ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
	ИначеЕсли ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена Тогда 
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиДругихСторон(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
	КонецЕсли;

	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	Если ЗначениеЗаполнено(Объект.Составитель) Тогда 
		ОтправительФайла = Объект.Составитель;
	Иначе
		ОтправительФайла = Объект.Фрахтователь;
	КонецЕсли;
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(ОтправительФайла);
	
	Если Не ПараметрыСервиса.АвторизацияВыполнена И ЗначениеЗаполнено(ОтправительФайла) Тогда
		
		ОстатокУИДов = РегистрыСведений.КонтурЛогистика_УИДыГИС.ОсталосьСвободныхУИДов(ОтправительФайла);
		Если ОстатокУИДов = 0 Тогда
			
			ТекстОшибки = "Не осталось свободных УИД в пуле. Получите новые.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"УИД_ДФ", КатегорияОшибка, ТекстОшибки, "Получить УИДы");
			
		КонецЕсли;
		
		Если ОстатокУИДов > 0 И Не ЗначениеЗаполнено(Объект.УИД_ДФ) Тогда 
			ТекстОшибки = "УИД будет взят из пула (при записи)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"УИД_ДФ", КатегорияПредупреждение, ТекстОшибки, "Взять сейчас");
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ДФ_Титул1.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЦикла;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьАдресПунктаМаршрута(
		Объект.МестоПодачи,
		ТаблицаОшибок,
		"МестоПодачи",
		"Укажите адрес места подачи в его карточке",
		КатегорияОшибка);
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("Составитель");
	МассивОбязательных.Добавить("ОснДовОргСост");
	МассивОбязательных.Добавить("МестоОтправления");
	МассивОбязательных.Добавить("СрокПЛИнтервал");
	МассивОбязательных.Добавить("ДополнительныеВодителиМассив");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("Фрахтователь");
	МассивОбязательных.Добавить("Фрахтовщик");
	МассивОбязательных.Добавить("СрокВыполненияПеревозки");
	МассивОбязательных.Добавить("ТСТип");
	МассивОбязательных.Добавить("МестоПодачи");
	МассивОбязательных.Добавить("Маршрут");
	МассивОбязательных.Добавить("ДатаИВремяПодачи");
	МассивОбязательных.Добавить("ПлатСтУсл");
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ОтгрузочноеНаименование");
	МассивОбязательных.Добавить("СостояниеГруза");
	МассивОбязательных.Добавить("ВидТары");
	МассивОбязательных.Добавить("СпособУпаковки");
	МассивОбязательных.Добавить("Объем");
	МассивОбязательных.Добавить("КоличествоМест");
	МассивОбязательных.Добавить("Высота");
	МассивОбязательных.Добавить("Длина");
	МассивОбязательных.Добавить("Ширина");
	МассивОбязательных.Добавить("МассаПлановаяБруттоКг");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ДополнительныеПолучателиФайлаМассивСтруктур",
		"Дополнительные получатели файла",
		"Указываются дополнительные получатели файла",
		"МассивСтруктур(см. таблицу ДополнительныеПолучателиФайла)",
		2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция МассивДополнительныхРеквизитовТЧ() Экспорт
	
	МассивДополнительных = Новый Массив();
	МассивДополнительных.Добавить(ДопРеквизитСтруктура("ОпасныеГрузыМассивСтруктур", "Опасные грузы", "Сведения об опасных грузах ДОПОГ", "МассивСтруктур(см. спр.КонтурЛогистика_ОписанияОпасныхГрузов)", 2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("kl_id");
	МассивКлючевых.Добавить("УИД_ДФ");
	МассивКлючевых.Добавить("ДокументОснование");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("СтатПодп");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	
	МассивКлючевых.Добавить("ДатИнфФт");
	МассивКлючевых.Добавить("ВрИнфФт");
	
	Возврат МассивКлючевых;
	
КонецФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ДФ_Титул1.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

Функция ПолучитьСледующийПоЦепочкеТипТитулаДФ(ДокДФТ1Ссылка) Экспорт
	
	Если Не ЗначениеЗаполнено(ДокДФТ1Ссылка) Тогда 
		ВызватьИсключение "Не заполнен Документ - не могу определить титул";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ДФ_Титул2) КАК ТипТитула
	               |ПОМЕСТИТЬ ВТ_ВсеТитулыДФ
	               |ИЗ
	               |	Документ.КонтурЛогистика_ДФ_Титул1 КАК КонтурЛогистика_ДФ_Титул1
	               |ГДЕ
	               |	КонтурЛогистика_ДФ_Титул1.Ссылка = &ДокументДФТ1
	               |	И НЕ КонтурЛогистика_ДФ_Титул1.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеТитулыДФ.ТипТитула КАК ТипТитула
	               |ИЗ
	               |	ВТ_ВсеТитулыДФ КАК ВТ_ВсеТитулыДФ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ВсеТитулыДФ.ТипТитула.Порядок УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументДФТ1", ДокДФТ1Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ТипТитула;
	Иначе
		Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ДФ_Титул1;
	КонецЕсли;
	
КонецФункции

#КонецЕсли
